<template>
    <div>
        <Notification v-for="(notif , i) in notifications" :key="i">
            <span slot="header" class="title">{{notif.title}}</span>
            <span slot="date" class="date">{{notif.date}}</span>
            <span slot="content" class="content">{{notif.content}}</span>
        </Notification>
    </div>
</template>
<script>
import Notification from '@/components/messages/notification';
export default {
    data(){
        return{
            notifications:[
                {
                    title : 'اعلان اول' ,
                    content:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته',
                    date:'۹۸-۱۰-۲۲'
                },
                {
                    title : 'اعلان اول' ,
                    content:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته',
                    date:'۹۸-۱۰-۲۲'
                },
                {
                    title : 'اعلان اول' ,
                    content:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته',
                    date:'۹۸-۱۰-۲۲'
                },

            ]
        }
    },
    components:{
        Notification,
    },
    computed(){

    }
}
</script>
<style lang="scss">
</style>