<template>
    <div class="chat-wrapper" data-aos="fade-down">
        <div v-for="(chat , i) in chats" :key="i">
            <Chat :message=chat.message :sender=chat.sender></Chat>
        </div>
    </div>
</template>
<script>
import Chat from '@/components/chat-history/chat'
export default {
    data(){
        return{
            chats:[
                {
                    message: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.',
                    date: '10-9-2019',
                    sender: 'صادقی'
                },
                {
                    message: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.',
                    date: '10-9-2019',
                    sender: 'صادقی'
                },
                {
                    message: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.',
                    date: '10-9-2019',
                    sender: 'صادقی'
                },
            ]
        }
    },
    components:{
        Chat
    }
}
</script>
<style lang="scss">
    .chat-wrapper{
        padding: 15px;
    }
</style>